Good evening @Dotisandhyarani 
thanks for taking your time for testing the recommendation!

Could you please review the AWS provider version you use? Required is v4.59.0 and in your code it is v4.50.0.
Here it the updated code snippet:

```hcl
aws = {
      source  = "hashicorp/aws"
      version = "~> 4.59.0, < 5.0.0"
    }
```


I tested with below code snippet

```hcl
resource "aws_dynamodb_table" "dynamo_table" {
  name = "dynamo_table"
  hash_key = "id"
  billing_mode = "PAY_PER_REQUEST"
  deletion_protection_enabled = true
  attribute {
    name = "id"
   type = "S"
 }
}
```

and this is the output using v4.59.0

```shell
stefan@stefan-IdeaPad-5-Pro-16ACH6:~/temp$ terraform init
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v4.59.0

Terraform has been successfully initialized!
[...]
stefan@stefan-IdeaPad-5-Pro-16ACH6:~/temp$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.dynamo_table will be created
  + resource "aws_dynamodb_table" "dynamo_table" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = true
      + hash_key                    = "id"
      + id                          = (known after apply)
      + name                        = "dynamo_table"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags_all                    = (known after apply)
      + write_capacity              = (known after apply)
      + attribute {
          + name = "id"
          + type = "S"
        }
      + point_in_time_recovery (known after apply)
      + server_side_encryption (known after apply)
      + ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

The same code snippet used with provider v4.50.0 would give an error during plan phase

```shell
stefan@stefan-IdeaPad-5-Pro-16ACH6:~/temp$ terraform plan
╷
│ Error: Unsupported argument
│ 
│   on main.tf line 29, in resource "aws_dynamodb_table" "dynamo_table":
│   29: deletion_protection_enabled = true
│ 
│ An argument named "deletion_protection_enabled" is not expected here.
```

Hope that helps. If not, please let me know!